Revit 2024 API
PostPattern Class
 Post pattern class.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public class PostPattern : IDisposable
Visual Basic
Public Class PostPattern _
	Implements IDisposable
Visual C++
public ref class PostPattern : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Architecture.PostPattern
See Also
PostPattern Members
Autodesk.Revit.DB.Architecture Namespace